# vstSetDataReal

## Description
```pascal
PROCEDURE vstSetDataReal(
				inDataID   : LONGINT;
				inDataVal  : REAL;
				VAR result : BOOLEAN);
```

```python

def vs.vstSetDataReal(inDataID, inDataVal):
    return result
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|inDataVal|REAL||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events